app/Http/Controllers/Admin/RoleController.php

    public function index(Request $request)
    {
        $key = $request->search;
        if (!empty($key)) {
            $roles = $this->roleRepository->search($key)->orderBy('id', 'DESC')->paginate($this->roleRepository->perPage);
        } else {
            $roles = $this->roleRepository->orderBy('id', 'DESC')->paginate($this->roleRepository->perPage);
---
select * from `roles` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `roles`