app/Http/Controllers/Admin/UserController.php

    public function index(Request $request)
    {
        $key = $request->search;
        $role_id = $request->role;
        if (!empty($key) || !empty($role_id)) {
            $users = $this->userRepository->searchUsers($key, $role_id);
        } else {
            $users = $this->userRepository->orderBy('id', 'DESC')->paginate($this->userRepository->perPage);
---
select * from `users` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `users`